Revit 2026 API

# FieldDomainPointsByParameter Constructor

---

Initializes a new instance of the FieldDomainPointsByParameter class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldDomainPointsByParameter(
	IList<double> points
)
```
```vb
Public Sub New (
	points As IList(Of Double)
)
```
```cpp
public:
FieldDomainPointsByParameter(
	IList<double>^ points
)
```
```fsharp
new :
        points : IList<float> -> FieldDomainPointsByParameter
```

#### Parameters

points IListDouble

#### Reference

FieldDomainPointsByParameter Class

Autodesk.Revit.DB.Analysis Namespace